Tekla.Structures.Drawing.DetailMark
The DetailMark class defines a drawing object that illustrates a detail in a specific view.
The following code inserts a new detail mark in the current drawing:
using Tekla.Structures.Drawing;
using Tekla.Structures.Geometry3d;
public class DetailMarkExample
{
public void DetailMarkInsert()
{
DrawingHandler myDrawingHandler = new DrawingHandler();
if (myDrawingHandler.GetConnectionStatus())
{
DrawingObjectEnumerator viewsEnumerator = myDrawingHandler.GetActiveDrawing().GetSheet().GetAllViews();
View view = null;
if (viewsEnumerator.MoveNext())
view = viewsEnumerator.Current as View;
if (view != null)
{
DetailMark detailMark = new DetailMark(view, new Point(50, 100), new Point(100, 150), new Point(200, 200));
detailMark.Insert();
}
}
}
}

Tekla.Structures.Drawing.DetailMark.CenterPoint
The center point of the mark.

Tekla.Structures.Drawing.DetailMark.BoundaryPoint
The boundary point of the mark.

Tekla.Structures.Drawing.DetailMark.LabelPoint
The label point of the mark.

Tekla.Structures.Drawing.DetailMark.Attributes
The attributes for the detail mark.

Tekla.Structures.Drawing.DetailMark.#ctor(Tekla.Structures.Drawing.View,Tekla.Structures.Geometry3d.Point,Tekla.Structures.Geometry3d.Point,Tekla.Structures.Geometry3d.Point)
Creates a new detail mark instance with the given positions.
view: The view to be used.
centerPoint: The center point to be used.
boundaryPoint: The boundary point to be used.
labelPoint: The label point to be used.

Tekla.Structures.Drawing.DetailMark.#ctor(Tekla.Structures.Drawing.View,Tekla.Structures.Geometry3d.Point,Tekla.Structures.Geometry3d.Point,Tekla.Structures.Geometry3d.Point,Tekla.Structures.Drawing.DetailMark.DetailMarkAttributes)
Creates a new detail mark instance with the given positions and attributes.
view: The view to be used.
centerPoint: The center point to be used.
boundaryPoint: The boundary point to be used.
labelPoint: The label point to be used.
detailMarkAttributes: The detail mark attributes to be used.

Tekla.Structures.Drawing.DetailMark.DbOperation(Tekla.Structures.DrawingInternal.QueryTypeEnum)
Call TS and perform database operation specified in OperationType.
OperationType: The type of the operation.

Tekla.Structures.Drawing.DetailMark.Delete
Deletes the detail mark from the current drawing database.
Returns: True on success.

Tekla.Structures.Drawing.DetailMark.Modify
Modifies the detail mark in the current drawing database.
Returns: True on success.

Tekla.Structures.Drawing.DetailMark.Insert
Inserts the detail mark into the current drawing database.
Returns: True on success.

Tekla.Structures.Drawing.DetailMark.Select
Selects the detail mark from the current drawing database.
Returns: True on success.

Tekla.Structures.Drawing.DetailMark.IsEqual(System.Object)
Compares the current object with an object of the same type.
ObjectToCompare: The object to be used for comparing.
Returns: True if all the fields (except for the database GUID) of the objects match.